cf_billing/Documents/бестСменаПоставщикаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестСменаПоставщикаНП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестМаксимальныеПоказанияНП</xr:Item>
				<xr:Item>InformationRegister.энргПоказанияПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.энргПоставщикиУслугАбонента</xr:Item>
				<xr:Item>InformationRegister.энргВыводПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.бестПоказанияПриборовУчетаНП</xr:Item>
				<xr:Item>InformationRegister.бестПоставщикиУслугНП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоставщикиСоставныхУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастьСоставнойУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоставщикПосле</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопустимыйОбъемОтклонений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходЗаПредМесяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходЗаАналогичныйПериодПредГода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПочасовойВедомости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСоставнаяУслуга</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоставщикПосле</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиРодитель</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоверкиСчетчика</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриемки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстановкиПломбы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПрибора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеИспользованияТУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеТочки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Enums/энргСостояниеПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/бестСменаПоставщикаНП/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
	
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"ПоставщикПосле");
	// энргРаботаСПоставщиками }
		
	ЗаполнитьДокумент = Ложь;
	Если Параметры.Свойство("ЗаполнитьДокумент") Тогда
		ЗаполнитьДокумент = Параметры.ЗаполнитьДокумент;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) И ЗаполнитьДокумент тогда
		ЗаполнитьДанныеДоговораСервер();		
	КонецЕсли; 
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестСменаПоставщикаНП(ЭтотОбъект, Объект.Ссылка);
	
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
		
	//энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
		
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("бестИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьПоказанияПередЗаписью();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	энргПользовательскийВводСервер.ЗаписатьПараметрыТочекИПриборовУчета(Объект.ТочкиУчета, ТекущийОбъект);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	//бестРаботаСПоказаниямиПриборовУчетаНПСервер.КонтрольОшибкиДругойЗоны(Объект, "бестСменаПоставщикаНП");
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	энргРаботаСприборамиУчетаСервер.ПриЧтенииНаСервере(ЭтотОбъект, "ТочкиУчета");
	бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоНП(Объект.Организация, Объект.ПериодНачисления,Объект.Район,Объект.ОбъектРасчета);

	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестСменаПоставщикаНП(ЭтотОбъект, Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьАдресОбъекта();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Район)Тогда
		 ЗаполнитьПериодНачисленияСервер();
	 КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ОбновитьТЧ();
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	Если ЗначениеЗаполнено(Объект.ТочкиУчета) Тогда  
		ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
		УстановитьУсловноеОФормлениеФормыКлиент("ПоставщикПосле","ПараметрыПоставщиков");
	КонецЕсли;
	ЗаполнитьАдресОбъекта();
	
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргПользовательскийВводКлиент.НачалоВыбораТочкиУчета(Элемент,Объект.Дата,Объект.Организация,Объект.Район,Объект.КлючПомещения,СтандартнаяОбработка); 
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаУслугаПриИзменении(Элемент)
	ТекСтрока  					= Элементы.ТочкиУчета.ТекущиеДанные;
	// энргРаботаСПоставщиками {
	энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекСтрока,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекСтрока.Услуга)); 
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикПослеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ТекСтрока  					= Элементы.ТочкиУчета.ТекущиеДанные;	
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекСтрока,Новый Структура("ИмяСвойстваПоставщик","ПоставщикПосле"));
	// энргРаботаСПоставщиками }  
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	// энргРаботаСПоставщиками {
	ТекДанные 								= Элементы.ТочкиУчета.ТекущиеДанные;
	энргРаботаСПоставщикамиКлиент.ПередУдалением(ЭтаФорма,ТекДанные);
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПоставщикПослеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		// энргРаботаСПоставщиками {
	ТекСтрока  					= Элементы.ТочкиУчета.ТекущиеДанные;
	Если не ТекСтрока.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекСтрока,Новый Структура("ИмяСвойстваПоставщик","ПоставщикПосле"));
	// энргРаботаСПоставщиками }

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказанияПриборовУчета

&НаКлиенте
Процедура ПоказанияПриборовУчетаТекущиеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();
	//ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	//Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
	//	  Возврат;
	//КонецЕсли;
	//ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	//энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	//энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
		ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));

КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные)
	ДопПараметры = Новый Структура("РегистрируетОбъем,ЭтоВводПУ,НеРегистрацияОбъема",ТекущиеДанные.РегистрируетОбъем,Истина,Истина);
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма,ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ПередУдалениемСтрокиТочкиУчета()
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
		
	ТабЧасть  								= объект.ШкалыПриборовУчета ;
	СтрокиТЧ 								= ТабЧасть.найтиСтроки(Новый Структура("IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки));
	для Каждого СтрокаТЧ из СтрокиТЧ цикл
		СтрокиПоказаний 					= объект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаТЧ.IDСтроки));
		Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл
			 объект.ПоказанияПриборовУчета.Удалить(СтрокаПоказаний);
		КонецЦикла;				
		ТабЧасть.удалить(СтрокаТЧ);
	КонецЦикла;
	
	//ТабЧасть  								= объект.ШкалыПриборовУчета ;
	//СтрокиТЧ 								= ТабЧасть.найтиСтроки(Новый Структура("IDСтрокиТочкиУчета",ТекущиеДанные.IDСтрокиВывод));
	//для Каждого СтрокаТЧ из СтрокиТЧ цикл
	//	СтрокиПоказаний 					= объект.ПоказанияПриборовУчета.НайтиСтроки(Новый Структура("IDСтроки", СтрокаТЧ.IDСтроки));
	//	Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл
	//		 объект.ПоказанияПриборовУчета.Удалить(СтрокаПоказаний);
	//	КонецЦикла;				
	//	ТабЧасть.удалить(СтрокаТЧ);
	//КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства=Неопределено, ИмяРеквизитаФормы="ПараметрыПоставщиков") Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДоговораСервер()
	
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ТочкиУчета.Очистить();
	Объект.ШкалыПриборовУчета.Очистить();
	Объект.ПоставщикиСоставныхУслуг.Очистить();
	Период = КонецДня(Объект.Дата);
	
	Результат 									= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(Объект.Дата,Объект.Организация,Объект.Район, Объект.ОбъектРасчета,Истина);
	//Результат 									= РегистрыСведений.бестПоставщикиУслугНП.ПолучитьДействующиеПриборыУчетаВместеСПоставщиками(Объект.Организация,Объект.Район,Объект.Дата,МВТ);
	
	Выборка  									= Результат.выбрать();
	ТекТочкаУчета 								= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	
	Пока Выборка.следующий() цикл
		Если ТекТочкаУчета <> Выборка.ТочкаУчета Тогда
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
			СтрокаТочкиУчета.ЭтоСоставнаяУслуга = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Услуга,"СоставнаяУслуга");
			
			РезультатПоставщики = РегистрыСведений.бестПоставщикиУслугНП.ПолучитьДанныеПоставщиков(Объект.Организация, Объект.Район, Новый Граница(Объект.Дата, ВидГраницы.Исключая),,Выборка.ТочкаУчета,Выборка.Услуга,Истина);
			ВыборкаПоставщики = РезультатПоставщики.Выбрать();
			Пока ВыборкаПоставщики.следующий() цикл
				Если ВыборкаПоставщики.Услуга = ВыборкаПоставщики.ЧастьСоставной Тогда
					СтрокаТочкиУчета.Поставщик = ВыборкаПоставщики.Поставщик;
					СтрокаТочкиУчета.ПоставщикПосле = ПараметрыПоставщиков.ПоставщикПоУмолчанию;
				Иначе
					СтрокаПоставщикиСоставныхУслуг = Объект.ПоставщикиСоставныхУслуг.Добавить();
					СтрокаПоставщикиСоставныхУслуг.IDСтроки 			= IDСтрокиТочки;
					СтрокаПоставщикиСоставныхУслуг.ЧастьСоставнойУслуги = ВыборкаПоставщики.ЧастьСоставной;
					СтрокаПоставщикиСоставныхУслуг.Поставщик 			= ВыборкаПоставщики.Поставщик;
					СтрокаПоставщикиСоставныхУслуг.ПоставщикПосле 		= ПараметрыПоставщиков.ПоставщикПоУмолчанию;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		КонецЕсли;
		
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
	КонецЦикла;	
	

	бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Ложь);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);

	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма);
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"ПоставщикПосле");
КонецПроцедуры

&НаСервере
Процедура ПроверитьПоказанияПередЗаписью()
	
	ПоказанияПриборов = Объект.ПоказанияПриборовУчета;
	//бестРаботаСПоказаниямиПриборовУчетаНПСервер.ПроверитьОшибкуПрофиля(ПоказанияПриборов);
	бестРаботаСПоказаниямиПриборовУчетаНПСервер.КонтрольОшибкиДругойЗоны(ПоказанияПриборов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТЧ()
	
	Перем ИмяТаблицыТочек, ИмяТаблицыШкал;
	
	ЗаполнитьДанныеДоговораСервер();
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	// Если Функ. опция истина, то будем заполнять имя шкалы
	Если ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыШкал						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
		// Внес в условие с проверкой Шкал
		Если ЗначениеЗаполнено(Объект.ШкалыПриборовУчета) Тогда 
			Элементы[ИмяТаблицыШкал].ТекущаяСтрока	= Объект.ШкалыПриборовУчета[0].ПолучитьИдентификатор();	
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ТочкиУчета.Количество()<>0 Тогда 
		Элементы[ИмяТаблицыТочек].ТекущаяСтрока	= Объект.ТочкиУчета[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПриборовУчета(ДанныеСтроки  = Неопределено)
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон.ТекущиеДанные;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны.ТекущиеДанные;
	Иначе	
		текСтрока 								= Элементы.ТочкиУчетаНетШкалНетТарифныхЗон.ТекущиеДанные;
	КонецЕсли;
	
	Если текСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ДанныеСтроки <> Неопределено тогда
		ЗаполнитьЗначенияСвойств(текСтрока,ДанныеСтроки);
	КонецЕсли;
	
	бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ПересчитатьСтрокуПриборовУчета(текСтрока, Объект.Дата, Ложь);	
	
	Если текСтрока.СостояниеПоказаний = ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Показания отклонены"); 		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТочкиНаОснованииДереваУслуг(Строки, Родитель)
	
Для Каждого Строка Из Строки Цикл 		
		СтрокаТочки  						= Объект.ТочкиУчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТочки, Строка);
		Если Не Родитель = Неопределено Тогда
			СтрокаТочки.IDСтрокиРодитель	= Родитель;			
		КонецЕсли;
		ЗаполнитьТочкиНаОснованииДереваУслуг(Строка.ПолучитьЭлементы(), Строка.IDСтроки);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = бестРаботаСОбъектамиНПВызовСервера.ВернутьАдресОбъектаРасчета(Объект.ОбъектРасчета);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПоставщикПослеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщикПосле,ИмяСвойстваПоставщик","ПоставщикПосле", "Поставщик"));
	//энргРаботаСПоставщикамиКлиент.ПриИзмененииУслуги(ЭтаФорма,ТекущиеДанные,энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга)); 
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыШкал							= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;

		
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ПриборУчета) Тогда 
		энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,Неопределено); 
	КонецЕсли;
	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки);	
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
	
	// Активизируем первую строку в таблице шкал
	СтрокиШкал = Объект.ШкалыПриборовУчета.НайтиСтроки(Новый Структура("IDСтрокиТочкиУчета", ТекущиеДанные.IDСтроки));
	Если ЗначениеЗаполнено(СтрокиШкал) Тогда
		Элементы[ИмяТаблицыШкал].ТекущаяСтрока = СтрокиШкал[0].ПолучитьИдентификатор();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТочкиУчета) Тогда 
		ОписаниеУслуги = энргРаботаСПоставщикамиСервер.ОписаниеУслуги(ТекущиеДанные.Услуга);
		//бестРаботаСПоставщикамиКлиент.ПриИзмененииУслугиПосле(ЭтаФорма,ТекущиеДанные,ОписаниеУслуги); 	
		УстановитьУсловноеОФормлениеФормыКлиент("ПоставщикПосле","ПараметрыПоставщиков");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	ПередУдалениемСтрокиТочкиУчета();
КонецПроцедуры

#Конецобласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
КонецПроцедуры

#Конецобласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчетаНетШкалЕстьТарифныеЗоны 

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаНетШкалЕстьТарифныеЗоны";
		
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФормыПоказаний					= Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны;	
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыПоказаний,"IDСтроки",ТекущиеДанные.IDСтрокиШкалы);
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПередУдалением(Элемент, Отказ)
	ПередУдалениемСтрокиТочкиУчета();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчетаЕстьШкалыНетТарифныхЗон 

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалНетТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыНетТарифныхЗон";
	 
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	
	ИмяТаблицы								= "ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон";
	ТаблицаФормы	 						= Элементы[ИмяТаблицы];
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормы,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки);
	// энргРаботаСВидомДифференцированности }
	
	РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалНетТарифныеЗоныПередУдалением(Элемент, Отказ)
	ПередУдалениемСтрокиТочкиУчета();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчетаНетШкалНетТарифныхЗон 

&НаКлиенте
Процедура ТочкиУчетаНетШкалыНетТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

#КонецОбласти
